In [67]:
#Regular dictionary within dictionary
SpotCrudePrices_2013_Data={
    'U.K. Brent' : {'2013-Q1':112.9, '2013-Q2':103.0, '2013-Q3':110.1, '2013-Q4':109.4},
    
    'Dubai':{'2013-Q1':108.1, '2013-Q2':100.8, '2013-Q3':106.1,'2013-Q4':106.7},
    
    'West Texas Intermediate':{'2013-Q1':94.4, '2013-Q2':94.2, '2013-Q3':105.8,'2013-Q4':97.4}
}

In [68]:
import pandas as pd

In [6]:
#Create dataframe from dict of dict
dubaiPrices = pd.DataFrame.from_dict(SpotCrudePrices_2013_Data)
dubaiPrices

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [69]:
#directly passing as a dictionary
pd.DataFrame(SpotCrudePrices_2013_Data)

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [8]:
SpotCrudePrices_2013_Data

{'Dubai': {'2013-Q1': 108.1,
  '2013-Q2': 100.8,
  '2013-Q3': 106.1,
  '2013-Q4': 106.7},
 'U.K. Brent': {'2013-Q1': 112.9,
  '2013-Q2': 103.0,
  '2013-Q3': 110.1,
  '2013-Q4': 109.4},
 'West Texas Intermediate': {'2013-Q1': 94.4,
  '2013-Q2': 94.2,
  '2013-Q3': 105.8,
  '2013-Q4': 97.4}}

In [19]:
dubaiPrices[['Dubai']]

         Dubai
2013-Q1  108.1
2013-Q2  100.8
2013-Q3  106.1
2013-Q4  106.7

In [20]:
dubaiPrices.Dubai

2013-Q1    108.1
2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: Dubai, dtype: float64

In [21]:
dubaiPrices.columns

Index(['Dubai', 'U.K. Brent', 'West Texas Intermediate'], dtype='object')

In [22]:
dubaiPrices.index

Index(['2013-Q1', '2013-Q2', '2013-Q3', '2013-Q4'], dtype='object')

In [23]:
dubaiPrices.mean()

Dubai                      105.425
U.K. Brent                 108.850
West Texas Intermediate     97.950
dtype: float64

In [24]:
#
dubaiPrices.describe()

            Dubai  U.K. Brent  West Texas Intermediate
count    4.000000    4.000000                 4.000000
mean   105.425000  108.850000                97.950000
std      3.195179    4.182902                 5.434151
min    100.800000  103.000000                94.200000
25%    104.775000  107.800000                94.350000
50%    106.400000  109.750000                95.900000
75%    107.050000  110.800000                99.500000
max    108.100000  112.900000               105.800000

In [25]:
dubaiPrices

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [70]:
#Changing col names
dubaiPrices.columns = ['Dubai','Brent','Texas']

In [27]:
dubaiPrices

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [9]:
#Get data by column index, 1 & 2 are col index
dubaiPrices[[1,2]]

         U.K. Brent  West Texas Intermediate
2013-Q1       112.9                     94.4
2013-Q2       103.0                     94.2
2013-Q3       110.1                    105.8
2013-Q4       109.4                     97.4

In [29]:
import numpy as np
#Use arange to access elements
dubaiPrices[np.arange(1,3)]

         Brent  Texas
2013-Q1  112.9   94.4
2013-Q2  103.0   94.2
2013-Q3  110.1  105.8
2013-Q4  109.4   97.4

#### Use slicing to extract rows

In [72]:
dubaiPrices[2:3]

         Dubai  Brent  Texas
2013-Q3  106.1  110.1  105.8

In [73]:
dubaiPrices[0:3:2]

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q3  106.1  110.1  105.8

In [31]:
dubaiPrices[2:]

         Dubai  Brent  Texas
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [32]:
dubaiPrices[::-1]

         Dubai  Brent  Texas
2013-Q4  106.7  109.4   97.4
2013-Q3  106.1  110.1  105.8
2013-Q2  100.8  103.0   94.2
2013-Q1  108.1  112.9   94.4

In [33]:
dubaiPrices[np.arange(2,3)]

         Texas
2013-Q1   94.4
2013-Q2   94.2
2013-Q3  105.8
2013-Q4   97.4

In [15]:
# Dictionary of lists
NYC_SnowAvgsData={
    'Months' :['January','February','March', 'April', 'November', 'December'],
    'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
    'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
    'Avg Low Temp. (F)' : [27,29,35,45,42,32] 
}

In [16]:
NYC_SnowAvgs_index=pd.DataFrame(NYC_SnowAvgsData,
                                
        index= NYC_SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)']
)

In [22]:
NYC_SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [18]:
NYC_SnowAvgs=pd.DataFrame(NYC_SnowAvgsData,  
        columns = ['Months','Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [19]:
NYC_SnowAvgs

     Months  Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
0   January           4.0              17.8                 27
1  February           2.7              22.4                 29
2     March           1.7               9.1                 35
3     April           0.2               1.5                 45
4  November           0.2               0.8                 42
5  December           2.3              12.2                 32

### loc iloc ix
* This gives you access to a specific data

In [39]:
#This gets sliced data
dubaiPrices[2:]

         Dubai  Brent  Texas
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [38]:
NYC_SnowAvgs_index.loc['January']['Avg SnowDays']

4.0

In [21]:
NYC_SnowAvgs_index.loc[['January','April']]

         Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January           4.0              17.8                 27
April             0.2               1.5                 45

In [23]:
NYC_SnowAvgs_index.loc[:'April']

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [ ]:
#NYC_SnowAvgs_index.loc[1:4]
#Fails

In [24]:
NYC_SnowAvgs_index[1:4]

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [25]:
NYC_SnowAvgs_index.iloc[1:4]

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [44]:
#First element is row, next one is column
NYC_SnowAvgs_index.iloc[1:,:2]

          Avg SnowDays  Avg Precip. (cm)
February           2.7              22.4
March              1.7               9.1
April              0.2               1.5
November           0.2               0.8
December           2.3              12.2

In [45]:
NYC_SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [46]:
#Same index name being used
SnowAvgsData={'Months' :
['January','February','April', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [47]:
SnowAvgs_index=pd.DataFrame(SnowAvgsData,  
                          index= SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [48]:
SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
April              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [49]:
SnowAvgs_index.loc['April']

       Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
April           1.7               9.1                 35
April           0.2               1.5                 45

In [26]:
NYC_SnowAvgsData={'Months' :
['January','February','March', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [27]:
NYC_SnowAvgs=pd.DataFrame(NYC_SnowAvgsData,  
                         index= NYC_SnowAvgsData['Months'], 
        columns = ['Months','Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [35]:
NYC_SnowAvgs.loc[(NYC_SnowAvgs['Avg SnowDays']>1) & (NYC_SnowAvgs['Avg SnowDays']<2),['Avg SnowDays','Avg Precip. (cm)']]

       Avg SnowDays  Avg Precip. (cm)
March           1.7               9.1

In [77]:
#Selecting using boolean array
NYC_SnowAvgs.loc[(NYC_SnowAvgs['Avg SnowDays']>1) & (NYC_SnowAvgs['Avg SnowDays']<2),:]

      Months  Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
March  March           1.7               9.1                 35

In [53]:
#Returns boolean array
NYC_SnowAvgs['Avg SnowDays']<1

January     False
February    False
March       False
April        True
November     True
December    False
Name: Avg SnowDays, dtype: bool

In [54]:
dubaiPrices
dubaiPrices.loc['2013-Q1']>110

Dubai    False
Brent     True
Texas    False
Name: 2013-Q1, dtype: bool

In [36]:
dubaiPrices

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [37]:
dubaiPrices.loc[:,dubaiPrices.loc['2013-Q1']>105]

         Dubai  U.K. Brent
2013-Q1  108.1       112.9
2013-Q2  100.8       103.0
2013-Q3  106.1       110.1
2013-Q4  106.7       109.4

In [56]:
dubaiPrices

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [57]:
dubaiPrices.loc['2013-Q1']>109

Dubai    False
Brent     True
Texas    False
Name: 2013-Q1, dtype: bool

### iloc - Integer Oriented Indexing

In [58]:
dubaiPrices

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [59]:
dubaiPrices.iloc[1:,2:]

         Texas
2013-Q2   94.2
2013-Q3  105.8
2013-Q4   97.4

In [60]:
#Accessing by index id
dubaiPrices.iat[3,0]

106.7

In [61]:
#Accessing by value
dubaiPrices.at['2013-Q4','Dubai']

106.7

### Thumb Rules
* at -> Access a specific value given index & col
  dubaiPrices.at['2013-Q4','Dubai']
  
* iat -> Access a specific value given index id & col id
* loc -> Access row by index value 
  NYC_SnowAvgs_index.loc['January']['Avg SnowDays']
  
* iloc -> Access row by index id

In [62]:
import pandas as pd

In [40]:
stockDF = pd.read_csv(r'D:\data-science-ml-foundation-10\Stock.csv')

In [41]:
stockDF

  TradingDate   Nasdaq  S&P 500  Russell 2000
0  2014/01/30  4123.13  1794.19       1139.36
1  2014/01/31  4103.88  1782.59       1130.88
2  2014/02/03  3996.96  1741.89       1094.58
3  2014/02/04  4031.52  1755.20       1102.84
4  2014/02/05  4011.55  1751.64       1093.59
5  2014/02/06  4057.12  1773.43       1103.93

In [65]:
stockIndexDF = stockDF.set_index('TradingDate')

In [66]:
stockIndexDF

              Nasdaq  S&P 500  Russell 2000
TradingDate
2014/01/30   4123.13  1794.19       1139.36
2014/01/31   4103.88  1782.59       1130.88
2014/02/03   3996.96  1741.89       1094.58
2014/02/04   4031.52  1755.20       1102.84
2014/02/05   4011.55  1751.64       1093.59
2014/02/06   4057.12  1773.43       1103.93

In [67]:
###ix - loc first & iloc after that
stockIndexDF.ix['2014/02/03']

Nasdaq          3996.96
S&P 500         1741.89
Russell 2000    1094.58
Name: 2014/02/03, dtype: float64

In [68]:
stockIndexDF.ix[1]

Nasdaq          4103.88
S&P 500         1782.59
Russell 2000    1130.88
Name: 2014/01/31, dtype: float64

In [69]:
stockDF.ix[1]

TradingDate     2014/01/31
Nasdaq             4103.88
S&P 500            1782.59
Russell 2000       1130.88
Name: 1, dtype: object

### MultiIndexing

In [42]:
stock_data = pd.read_csv('MoreStock.csv')

In [43]:
stock_data

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [44]:
stock_Index_data = stock_data.set_index(['TradingDate','PriceType'])

In [73]:
stock_Index_data.head()

                        Nasdaq  S&P 500  Russell 2000
TradingDate PriceType
2014/02/21  open       4282.17  1841.07       1166.25
            close      4263.41  1836.25       1164.63
            high       4284.85  1846.13       1168.43
2014/02/24  open       4273.32  1836.78       1166.74
            close      4292.97  1847.61       1174.55

In [49]:
stock_Index_data.loc['2014/02/21']

            Nasdaq  S&P 500  Russell 2000
PriceType
open       4282.17  1841.07       1166.25
close      4263.41  1836.25       1164.63
high       4284.85  1846.13       1168.43

In [74]:
stock_Index_data.index

MultiIndex(levels=[['2014/02/21', '2014/02/24', '2014/02/25', '2014/02/26', '2014/02/27', '2014/02/28'], ['close', 'high', 'open']],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5], [2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1]],
           names=['TradingDate', 'PriceType'])

In [50]:
stock_Index_data.loc['2014/02/21','open']

Nasdaq          4282.17
S&P 500         1841.07
Russell 2000    1166.25
Name: (2014/02/21, open), dtype: float64

In [76]:
stock_Index_data.ix['2014/02/21':'2014/02/25']

                        Nasdaq  S&P 500  Russell 2000
TradingDate PriceType
2014/02/21  open       4282.17  1841.07       1166.25
            close      4263.41  1836.25       1164.63
            high       4284.85  1846.13       1168.43
2014/02/24  open       4273.32  1836.78       1166.74
            close      4292.97  1847.61       1174.55
            high       4311.13  1858.71       1180.29
2014/02/25  open       4298.48  1847.66       1176.00
            close      4287.59  1845.12       1173.95
            high       4307.51  1852.91       1179.43

In [52]:
births = pd.read_csv('births.csv')

In [53]:
births.describe()

               year         month         births
count  15547.000000  15547.000000   15547.000000
mean    1979.037435      6.515919    9762.293561
std        6.728340      3.449632   28552.465810
min     1969.000000      1.000000       1.000000
25%     1974.000000      4.000000    4358.000000
50%     1979.000000      7.000000    4814.000000
75%     1984.000000     10.000000    5289.500000
max     2008.000000     12.000000  199622.000000

In [54]:
births.columns

Index(['year', 'month', 'day', 'gender', 'births'], dtype='object')

In [56]:
birthidx = births.set_index(['year','month'])

In [62]:
len(birthidx.loc[1969,1])

64

In [64]:
len(birthidx[birthidx.gender == 'F'])

7776

In [65]:
len(birthidx[birthidx.gender == 'M'])

7771

In [66]:
birthidx

             day gender  births
year month
1969 1         1      F    4046
     1         1      M    4440
     1         2      F    4454
     1         2      M    4548
     1         3      F    4548
     1         3      M    4994
     1         4      F    4440
     1         4      M    4520
     1         5      F    4192
     1         5      M    4198
     1         6      F    4710
     1         6      M    4850
     1         7      F    4646
     1         7      M    5092
     1         8      F    4800
     1         8      M    4934
     1         9      F    4592
     1         9      M    4842
     1        10      F    4852
     1        10      M    5190
     1        11      F    4580
     1        11      M    4598
     1        12      F    4126
     1        12      M    4324
     1        13      F    4758
     1        13      M    5076
     1        14      F    5070
     1        14      M    5296
     1        15      F    4798
     1        15      M    5096
...          ...    ...     ...
2007 10     null      F  180912
     10     null      M  189157
     11     null      F  173513
     11     null      M  180814
     12     null      F  173787
     12     null      M  181426
2008 1      null      F  174255
     1      null      M  182789
     2      null      F  165669
     2      null      M  173434
     3      null      F  172053
     3      null      M  179129
     4      null      F  169585
     4      null      M  177399
     5      null      F  173141
     5      null      M  182294
     6      null      F  169958
     6      null      M  179267
     7      null      F  183391
     7      null      M  192714
     8      null      F  182713
     8      null      M  191315
     9      null      F  179696
     9      null      M  188964
     10     null      F  175314
     10     null      M  183219
     11     null      F  158939
     11     null      M  165468
     12     null      F  173215
     12     null      M  181235

[15547 rows x 3 columns]